nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core1.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_MIMXRT735S_cm33_core1.s                                */
/*  @purpose: CMSIS Cortex-M33 Core Device Startup File                      */
/*            MIMXRT735S_cm33_core1                                          */
/*  @version: 2.0                                                            */
/*  @date:    2024-5-28                                                      */
/*  @build:   b240626                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2024 NXP                                                   */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv8-m.main

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   SecureFault_Handler                             /* Secure Fault Handler*/
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    .long   0x180000                                        /* Image length*/
#else
    .long   _image_size                                     /* Image length*/
#endif
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   __isr_vector                                    /* Image load address*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   Reserved16_IRQHandler                           /* Reserved interrupt 16*/
    .long   Reserved17_IRQHandler                           /* Reserved interrupt 17*/
    .long   Reserved18_IRQHandler                           /* Reserved interrupt 18*/
    .long   FRO2_IRQHandler                                 /* FRO: 300MHz FRO in VDD1 domain Async interrupt*/
    .long   GLIKEY4_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   UTICK1_IRQHandler                               /* Micro-tick Timer*/
    .long   MRT1_IRQHandler                                 /* MRT: Ored Interrupt request*/
    .long   CTIMER5_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   CTIMER6_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   CTIMER7_IRQHandler                              /* CTIMER: Interrupt request*/
    .long   LPI2C15_IRQHandler                              /* LPI2C: Interrupt request*/
    .long   LP_FLEXCOMM17_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM18_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM19_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   LP_FLEXCOMM20_IRQHandler                        /* FLEXCOMM: Interrupt request*/
    .long   ADC_IRQHandler                                  /* ADC0: Interrupt request*/
    .long   SDADC_IRQHandler                                /* SDADC0: Interrupt request*/
    .long   GLIKEY1_IRQHandler                              /* GLIKEY: Interrupt*/
    .long   ACMP_IRQHandler                                 /* ACMP: interrupt request*/
    .long   PDM_EVENT_IRQHandler                            /* MIC: Interrupt request for read data or Error*/
    .long   HYPERVISOR_IRQHandler                           /* SECURE: Sense domain Hypervisor interrupt*/
    .long   SECURE_VIOLATION_IRQHandler                     /* SECURE: Sense domain Secure violation interrupt*/
    .long   PDM_HWVAD_EVENT_IRQHandler                      /* MIC: Hardware Voice Activity Detector interrupt or error interrupt*/
    .long   RTC1_ALARM_IRQHandler                           /* RTC: Alarm interrupt*/
    .long   RTC1_IRQHandler                                 /* RTC: wakeup interrupt to Sense domain*/
    .long   HIFI1_IRQHandler                                /* HIFI1: Interrupt request*/
    .long   MU1_B_IRQHandler                                /* MU1: MUB, CPU1 to CPU0*/
    .long   Reserved43_IRQHandler                           /* Reserved interrupt*/
    .long   MU3_A_IRQHandler                                /* MU3: MUA, CPU1 to HiFi1*/
    .long   PMC_IRQHandler                                  /* PMC: Sense domain Interrupt*/
    .long   OS_EVENT_IRQHandler                             /* OSEVENT: Event timer CPU1 Wakeup/interrupt*/
    .long   USDHC0_IRQHandler                               /* USDHC: Interrupt request*/
    .long   USDHC1_IRQHandler                               /* USDHC: Interrupt request*/
    .long   I3C2_IRQHandler                                 /* I3C: Interrupt Request*/
    .long   USB0_IRQHandler                                 /* USB: HSUSB Interrup request*/
    .long   USB1_IRQHandler                                 /* USB: eUSB Interrup request*/
    .long   WDT2_IRQHandler                                 /* WDT: Interrupt request*/
    .long   WDT3_IRQHandler                                 /* WDT: Interrupt request*/
    .long   USBPHY0_IRQHandler                              /* HSUSBPHY: UTM interrupt request*/
    .long   PMIC_IRQN_IRQHandler                            /* PMIC: External PMIC interrupt*/
    .long   I3C3_IRQHandler                                 /* I3C: Interrupt Request*/
    .long   FLEXIO_IRQHandler                               /* flexio: Interrupt request*/
    .long   Reserved58_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved59_IRQHandler                           /* Reserved interrupt*/
    .long   MIPI_IRQHandler                                 /* dsi: Interrupt request*/
    .long   EDMA2_CH0_IRQHandler                            /* edma2: Channel 0 interrupt*/
    .long   EDMA2_CH1_IRQHandler                            /* edma2: Channel 1 interrupt*/
    .long   EDMA2_CH2_IRQHandler                            /* edma2: Channel 2 interrupt*/
    .long   EDMA2_CH3_IRQHandler                            /* edma2: Channel 3 interrupt*/
    .long   EDMA2_CH4_IRQHandler                            /* edma2: Channel 4 interrupt*/
    .long   EDMA2_CH5_IRQHandler                            /* edma2: Channel 5 interrupt*/
    .long   EDMA2_CH6_IRQHandler                            /* edma2: Channel 6 interrupt*/
    .long   EDMA2_CH7_IRQHandler                            /* edma2: Channel 7 interrupt*/
    .long   EDMA3_CH0_IRQHandler                            /* edma3: Channel 0 interrupt*/
    .long   EDMA3_CH1_IRQHandler                            /* edma3: Channel 1 interrupt*/
    .long   EDMA3_CH2_IRQHandler                            /* edma3: Channel 2 interrupt*/
    .long   EDMA3_CH3_IRQHandler                            /* edma3: Channel 3 interrupt*/
    .long   EDMA3_CH4_IRQHandler                            /* edma3: Channel 4 interrupt*/
    .long   EDMA3_CH5_IRQHandler                            /* edma3: Channel 5 interrupt*/
    .long   EDMA3_CH6_IRQHandler                            /* edma3: Channel 6 interrupt*/
    .long   EDMA3_CH7_IRQHandler                            /* edma3: Channel 7 interrupt*/
    .long   GPIO80_IRQHandler                               /* rgpio8: Interupt request, channel 0*/
    .long   GPIO81_IRQHandler                               /* rgpio8: Interupt request, channel 1*/
    .long   GPIO90_IRQHandler                               /* rgpio9: Interupt request, channel 0*/
    .long   GPIO91_IRQHandler                               /* rgpio9: Interupt request, channel 1*/
    .long   GPIO100_IRQHandler                              /* rgpio10: Interupt request, channel 0*/
    .long   GPIO101_IRQHandler                              /* rgpio10: Interupt request, channel 1*/
    .long   Reserved83_IRQHandler                           /* Reserved interrupt 83*/
    .long   Reserved84_IRQHandler                           /* Reserved interrupt 84*/
    .long   PIN_INT0_IRQHandler                             /* pint1: Interupt request 0*/
    .long   PIN_INT1_IRQHandler                             /* pint1: Interupt request 1*/
    .long   PIN_INT2_IRQHandler                             /* pint1: Interupt request 2*/
    .long   PIN_INT3_IRQHandler                             /* pint1: Interupt request 3*/
    .long   SAI3_IRQHandler                                 /* sai3: TX/RX interrupt*/
    .long   XSPI2_IRQHandler                                /* xspi2: Ored interrupt*/
    .long   MMU2_IRQHandler                                 /* mmu2: Interrupt request*/
    .long   GDET2_IRQHandler                                /* gdet2_wrapper: Interrupt request*/
    .long   GDET3_IRQHandler                                /* gdet3_wrapper: Interrupt request*/
    .long   CDOG3_IRQHandler                                /* cdog3: Interrupt request*/
    .long   CDOG4_IRQHandler                                /* cdog4: Interrupt request*/
    .long   Reserved96_IRQHandler                           /* Reserved interrupt 96*/
    .long   CPU1_IRQHandler                                 /* CTI interrupt request*/
    .long   Reserved98_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved99_IRQHandler                           /* Reserved interrupt*/
    .long   Reserved100_IRQHandler                          /* Reserved interrupt 100*/
    .long   TEMPDET0_IRQHandler                             /* TEMPDET0: Temperature Detect Interrupt request 0*/
    .long   TEMPDET1_IRQHandler                             /* TEMPDET1: Temperature Detect Interrupt request 1*/
    .long   EZHV_IRQHandler                                 /* ezhv: Interrupt request*/
    .long   SLEEPCON1_IRQHandler                            /* SLEEPCON_SENSE CPU1 wakeup event*/
    .long   PVTS1_CPU1_IRQHandler                           /* PVTS1 CPU1 interrupt*/
    .long   Reserved106_IRQHandler                          /* Reserved interrupt 106*/
    .long   PVTS1_HIFI1_IRQHandler                          /* PVTS1 HIFI1 interrupt*/
    .long   Reserved108_IRQHandler                          /* Reserved interrupt 108*/

    .size   __isr_vector, . - __isr_vector

    .text
    .thumb

