nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/gcc/startup_MIMXRT735S_cm33_core1.S
    .align 1
    .thumb_func
    .weak SLEEPCON1_IRQHandler
    .type SLEEPCON1_IRQHandler, %function
SLEEPCON1_IRQHandler:
    ldr   r0,=SLEEPCON1_DriverIRQHandler
    bx    r0
    .size SLEEPCON1_IRQHandler, . - SLEEPCON1_IRQHandler

    .align 1
    .thumb_func
    .weak PVTS1_CPU1_IRQHandler
    .type PVTS1_CPU1_IRQHandler, %function
PVTS1_CPU1_IRQHandler:
    ldr   r0,=PVTS1_CPU1_DriverIRQHandler
    bx    r0
    .size PVTS1_CPU1_IRQHandler, . - PVTS1_CPU1_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved106_IRQHandler
    .type Reserved106_IRQHandler, %function
Reserved106_IRQHandler:
    ldr   r0,=Reserved106_DriverIRQHandler
    bx    r0
    .size Reserved106_IRQHandler, . - Reserved106_IRQHandler

    .align 1
    .thumb_func
    .weak PVTS1_HIFI1_IRQHandler
    .type PVTS1_HIFI1_IRQHandler, %function
PVTS1_HIFI1_IRQHandler:
    ldr   r0,=PVTS1_HIFI1_DriverIRQHandler
    bx    r0
    .size PVTS1_HIFI1_IRQHandler, . - PVTS1_HIFI1_IRQHandler

    .align 1
    .thumb_func
    .weak Reserved108_IRQHandler
    .type Reserved108_IRQHandler, %function
Reserved108_IRQHandler:
    ldr   r0,=Reserved108_DriverIRQHandler
    bx    r0
    .size Reserved108_IRQHandler, . - Reserved108_IRQHandler


/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm
/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SecureFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    Reserved16_DriverIRQHandler
    def_irq_handler    Reserved17_DriverIRQHandler
    def_irq_handler    Reserved18_DriverIRQHandler
    def_irq_handler    FRO2_DriverIRQHandler
    def_irq_handler    GLIKEY4_DriverIRQHandler
    def_irq_handler    UTICK1_DriverIRQHandler
    def_irq_handler    MRT1_DriverIRQHandler
    def_irq_handler    CTIMER5_DriverIRQHandler
    def_irq_handler    CTIMER6_DriverIRQHandler
    def_irq_handler    CTIMER7_DriverIRQHandler
    def_irq_handler    LPI2C15_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM17_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM18_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM19_DriverIRQHandler
    def_irq_handler    LP_FLEXCOMM20_DriverIRQHandler
    def_irq_handler    ADC_DriverIRQHandler
    def_irq_handler    SDADC_DriverIRQHandler
    def_irq_handler    GLIKEY1_DriverIRQHandler
    def_irq_handler    ACMP_DriverIRQHandler
    def_irq_handler    PDM_EVENT_DriverIRQHandler
    def_irq_handler    HYPERVISOR_DriverIRQHandler
    def_irq_handler    SECURE_VIOLATION_DriverIRQHandler
    def_irq_handler    PDM_HWVAD_EVENT_DriverIRQHandler
    def_irq_handler    RTC1_ALARM_DriverIRQHandler
    def_irq_handler    RTC1_DriverIRQHandler
    def_irq_handler    HIFI1_DriverIRQHandler
    def_irq_handler    MU1_B_DriverIRQHandler
    def_irq_handler    Reserved43_DriverIRQHandler
    def_irq_handler    MU3_A_DriverIRQHandler
    def_irq_handler    PMC_DriverIRQHandler
    def_irq_handler    OS_EVENT_DriverIRQHandler
    def_irq_handler    USDHC0_DriverIRQHandler
    def_irq_handler    USDHC1_DriverIRQHandler
    def_irq_handler    I3C2_DriverIRQHandler
    def_irq_handler    USB0_DriverIRQHandler
    def_irq_handler    USB1_DriverIRQHandler
    def_irq_handler    WDT2_DriverIRQHandler
    def_irq_handler    WDT3_DriverIRQHandler
    def_irq_handler    USBPHY0_DriverIRQHandler
    def_irq_handler    PMIC_IRQN_DriverIRQHandler
    def_irq_handler    I3C3_DriverIRQHandler
    def_irq_handler    FLEXIO_DriverIRQHandler
    def_irq_handler    Reserved58_DriverIRQHandler
    def_irq_handler    Reserved59_DriverIRQHandler
    def_irq_handler    MIPI_DriverIRQHandler
    def_irq_handler    EDMA2_CH0_DriverIRQHandler
    def_irq_handler    EDMA2_CH1_DriverIRQHandler
    def_irq_handler    EDMA2_CH2_DriverIRQHandler
    def_irq_handler    EDMA2_CH3_DriverIRQHandler
    def_irq_handler    EDMA2_CH4_DriverIRQHandler
    def_irq_handler    EDMA2_CH5_DriverIRQHandler
    def_irq_handler    EDMA2_CH6_DriverIRQHandler
    def_irq_handler    EDMA2_CH7_DriverIRQHandler
    def_irq_handler    EDMA3_CH0_DriverIRQHandler
    def_irq_handler    EDMA3_CH1_DriverIRQHandler
    def_irq_handler    EDMA3_CH2_DriverIRQHandler
    def_irq_handler    EDMA3_CH3_DriverIRQHandler
    def_irq_handler    EDMA3_CH4_DriverIRQHandler
    def_irq_handler    EDMA3_CH5_DriverIRQHandler
    def_irq_handler    EDMA3_CH6_DriverIRQHandler
    def_irq_handler    EDMA3_CH7_DriverIRQHandler
    def_irq_handler    GPIO80_DriverIRQHandler
    def_irq_handler    GPIO81_DriverIRQHandler
    def_irq_handler    GPIO90_DriverIRQHandler
    def_irq_handler    GPIO91_DriverIRQHandler
    def_irq_handler    GPIO100_DriverIRQHandler
    def_irq_handler    GPIO101_DriverIRQHandler
    def_irq_handler    Reserved83_DriverIRQHandler
    def_irq_handler    Reserved84_DriverIRQHandler
    def_irq_handler    PIN_INT0_DriverIRQHandler
    def_irq_handler    PIN_INT1_DriverIRQHandler
    def_irq_handler    PIN_INT2_DriverIRQHandler
    def_irq_handler    PIN_INT3_DriverIRQHandler
    def_irq_handler    SAI3_DriverIRQHandler
    def_irq_handler    XSPI2_DriverIRQHandler
    def_irq_handler    MMU2_DriverIRQHandler
    def_irq_handler    GDET2_DriverIRQHandler
    def_irq_handler    GDET3_DriverIRQHandler
    def_irq_handler    CDOG3_DriverIRQHandler
    def_irq_handler    CDOG4_DriverIRQHandler
    def_irq_handler    Reserved96_DriverIRQHandler
    def_irq_handler    CPU1_DriverIRQHandler
    def_irq_handler    Reserved98_DriverIRQHandler
    def_irq_handler    Reserved99_DriverIRQHandler
    def_irq_handler    Reserved100_DriverIRQHandler
    def_irq_handler    TEMPDET0_DriverIRQHandler
    def_irq_handler    TEMPDET1_DriverIRQHandler
    def_irq_handler    EZHV_DriverIRQHandler
    def_irq_handler    SLEEPCON1_DriverIRQHandler
    def_irq_handler    PVTS1_CPU1_DriverIRQHandler
    def_irq_handler    Reserved106_DriverIRQHandler
    def_irq_handler    PVTS1_HIFI1_DriverIRQHandler
    def_irq_handler    Reserved108_DriverIRQHandler

    .end
